rofiqcp/vesc_stm32f103rct6/src/hwconf/hw_status.c
#include "hwconf/hw.h"
#include "hwconf/hw_hoverboard.h"
#include "motor/mc_interface.h"
#include "motor/mcpwm_foc.h"
#include "comm/commands.h"
#include "stm32f1xx_hal.h"
#include "FreeRTOS.h"
#include "task.h"

// Variabel s_tone_level: state internal modul yang dipertahankan antar pemanggilan fungsi.
static volatile bool s_tone_level = false;
// Variabel g_vesc_buzzer_hz: state global firmware yang dibagikan antarbagian modul.
volatile uint16_t g_vesc_buzzer_hz = 0U;
// Variabel g_vesc_buzzer_remaining: state global firmware yang dibagikan antarbagian modul.
volatile uint32_t g_vesc_buzzer_remaining = 0U;
// Variabel g_vesc_startup_melody_active: penanda bahwa state atau fitur sedang aktif.
volatile uint8_t g_vesc_startup_melody_active = 0U;
// Variabel g_vesc_startup_melody_index: indeks elemen yang sedang diproses.
volatile uint8_t g_vesc_startup_melody_index = 0U;
// Variabel s_tone_running: state internal modul yang dipertahankan antar pemanggilan fungsi.
static volatile bool s_tone_running = false;
/* VESC-correct finite-beep support. A tone may be infinite (stopped only by an
 * explicit hw_status_tone_stop) or self-terminate after a fixed number of
 * half-cycles. The self-terminating path is what the vesc_stm32f103rct6 status-thread refactor
 * accidentally dropped when it removed the old s_tone_toggle_remaining guard:
 * without it a tone that the status task fails to stop (delayed/blocked/stopped
 * thread) keeps TIM3 toggling the pin forever, i.e. a stuck-ON buzzer. */
// Variabel s_tone_infinite: state internal modul yang dipertahankan antar pemanggilan fungsi.
static volatile bool s_tone_infinite = false;
// Variabel s_tone_toggle_remaining: state internal modul yang dipertahankan antar pemanggilan fungsi.
static volatile uint32_t s_tone_toggle_remaining = 0U;
// Variabel s_melody_sequencer: state internal modul yang dipertahankan antar pemanggilan fungsi.
static volatile bool s_melody_sequencer = false;
// Variabel s_melody_gap: state internal modul yang dipertahankan antar pemanggilan fungsi.
static volatile bool s_melody_gap = false;
// Variabel s_melody_next_index: indeks elemen yang sedang diproses.
static volatile uint8_t s_melody_next_index = 0U;
// Variabel g_vesc_buzzer_running: state global firmware yang dibagikan antarbagian modul.
volatile uint8_t g_vesc_buzzer_running = 0U;
// Variabel s_power_held: state internal modul yang dipertahankan antar pemanggilan fungsi.
static volatile bool s_power_held = true;
// Variabel s_status_started: status runtime untuk diagnostik atau keputusan kendali.
static bool s_status_started = false;

typedef struct {
    // Variabel hz: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    uint16_t hz;
    // Variabel duration_ms: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    uint16_t duration_ms;
} startup_note_t;

/* ~3 s VESC-inspired power-up chime. This is intentionally a buzzer melody,
 * not a blocking motor-beep sequence: the real VESC startup sound is normally
 * produced through the motor phases. The ascending E-major arpeggio gives the
 * same short, technical VESC-like character while keeping both bridges OFF.
 * Every tone/gap is advanced autonomously by TIM3, so it starts before the
 * FreeRTOS scheduler and never blocks UART or FOC startup. */
// Variabel s_startup_notes: state internal modul yang dipertahankan antar pemanggilan fungsi.
static const startup_note_t s_startup_notes[] = {
    {659U, 180U}, /* E5  */
    {
        0U, 55U
    }
    ,
    {831U, 180U}, /* G#5 */
    {
        0U, 55U
    }
    ,
    {988U, 210U}, /* B5  */
    {
        0U, 70U
    }
    ,
    {1319U, 260U}, /* E6  */
    {
        0U, 120U
    }
    ,
    {
        988U, 150U
    }
    ,
    {1175U, 150U}, /* D6  */
    {
        1319U, 180U
    }
    ,
    {
        0U, 80U
    }
    ,
    {1661U, 220U}, /* G#6 */
    {
        0U, 70U
    }
    ,
    {1976U, 260U}, /* B6  */
    {
        0U, 100U
    }
    ,
    {2637U, 520U}, /* E7 resolve */
    {
        0U, 350U
    }
};

/* TIM3 owns the complete startup melody so it starts before FreeRTOS and is
 * independent of timer_thread latency. Tone segments count half-cycles; silent
 * gaps run TIM3 at 1 kHz and count milliseconds. All helpers below are called
 * with interrupts already masked or from TIM3 IRQ itself. */
// Fungsi status_timer_stop_locked: menghentikan status timer stop locked dengan menonaktifkan output atau state
// terkait secara aman.
static void status_timer_stop_locked(void) {
    TIM3->DIER = 0U;
    TIM3->CR1 &= ~TIM_CR1_CEN;
    TIM3->SR = 0U;
    s_tone_running = false;
    s_tone_infinite = false;
    s_tone_toggle_remaining = 0U;
    s_melody_gap = false;
    g_vesc_buzzer_running = 0U;
    g_vesc_buzzer_hz = 0U;
    g_vesc_buzzer_remaining = 0U;
    s_tone_level = false;
    BUZZER_PORT->BRR = BUZZER_PIN;
}

// Parameter hz: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma pada
// lingkup ini.
// Parameter duration_ms: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks
// algoritma pada lingkup ini.
// Parameter gap: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma pada
// lingkup ini.
// Fungsi status_program_segment_locked: menjalankan operasi status program segment locked sesuai tanggung jawab
// modul dengan input tervalidasi dan state yang konsisten.
static void status_program_segment_locked(uint16_t hz, uint32_t duration_ms, bool gap) {
    TIM3->CR1 &= ~TIM_CR1_CEN;
    TIM3->DIER = 0U;
    TIM3->SR = 0U;
    TIM3->CNT = 0U;
    s_tone_level = false;
    BUZZER_PORT->BRR = BUZZER_PIN;
    s_tone_infinite = false;
    s_melody_gap = gap;

    if (gap) {
        TIM3->ARR = 999U; /* 1 MHz / 1000 = 1 ms update */
        s_tone_toggle_remaining = duration_ms ? duration_ms : 1U;
        g_vesc_buzzer_hz = 0U;
    }
    else {
        if (hz < 100U)
            hz = 100U;
        if (hz > 5000U)
            hz = 5000U;
        // Variabel arr: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
        uint32_t arr = 500000UL / (uint32_t)hz;
        if (arr == 0U)
            arr = 1U;
        TIM3->ARR = arr - 1U;
        // Variabel toggles: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
        uint64_t toggles = ((uint64_t)hz * 2ULL * (uint64_t)duration_ms + 999ULL) / 1000ULL;
        if (toggles == 0ULL)
            toggles = 1ULL;
        if (toggles > 0xFFFFFFFEULL)
            toggles = 0xFFFFFFFEULL;
        s_tone_toggle_remaining = (uint32_t)toggles;
        g_vesc_buzzer_hz = hz;
    }
    g_vesc_buzzer_remaining = s_tone_toggle_remaining;
    s_tone_running = true;
    g_vesc_buzzer_running = 1U;
    TIM3->EGR = TIM_EGR_UG;
    TIM3->SR = 0U;
    TIM3->DIER = TIM_DIER_UIE;
    TIM3->CR1 |= TIM_CR1_CEN;
}

// Fungsi status_melody_load_next_locked: memuat status melody load next locked dan memvalidasi integritas data
// sebelum digunakan oleh runtime.
static void status_melody_load_next_locked(void) {
    if (s_melody_next_index >= (uint8_t)(sizeof(s_startup_notes) / sizeof(s_startup_notes[0]))) {
        s_melody_sequencer = false;
        g_vesc_startup_melody_active = 0U;
        status_timer_stop_locked();
        return;
    }
    // Variabel note: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    const startup_note_t note = s_startup_notes[s_melody_next_index++];
    g_vesc_startup_melody_index = s_melody_next_index;
    status_program_segment_locked(note.hz, note.duration_ms, note.hz == 0U);
}

// Fungsi hw_status_startup_melody_begin: menjalankan operasi hw status startup melody begin sesuai tanggung
// jawab modul dengan input tervalidasi dan state yang konsisten.
static void hw_status_startup_melody_begin(void) {
    // Variabel primask: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    s_melody_sequencer = true;
    s_melody_next_index = 0U;
    g_vesc_startup_melody_active = 1U;
    g_vesc_startup_melody_index = 0U;
    status_melody_load_next_locked();
    if (!primask)
        __enable_irq();
}

// Fungsi hw_status_startup_melody_replay: menjalankan operasi hw status startup melody replay sesuai tanggung
// jawab modul dengan input tervalidasi dan state yang konsisten.
void hw_status_startup_melody_replay(void) {
    hw_status_startup_melody_begin();
}

/* Highest-priority fault present on either bridge owns both indicators. */
// Variabel s_fault_priority: status atau data gangguan untuk sistem proteksi.
static const motor_fault_t s_fault_priority[] = {
    MOTOR_FAULT_FLASH_CONFIG,
    MOTOR_FAULT_BREAK,
    MOTOR_FAULT_MCU_UNDER_VOLTAGE,
    MOTOR_FAULT_ABS_OVER_CURRENT,
    MOTOR_FAULT_ADC_DMA,
    MOTOR_FAULT_FOC_ISR_OVERRUN,
    MOTOR_FAULT_OVER_VOLTAGE,
    MOTOR_FAULT_UNDER_VOLTAGE,
    MOTOR_FAULT_CURRENT_OFFSET,
    MOTOR_FAULT_OVER_TEMP_BOARD,
    MOTOR_FAULT_OVER_TEMP_MOTOR,
    MOTOR_FAULT_OVERSPEED,
    MOTOR_FAULT_UNDERSPEED,
    MOTOR_FAULT_ABS_OVERSPEED,
    MOTOR_FAULT_ENCODER_SLIP,
    MOTOR_FAULT_HALL_INVALID,
    MOTOR_FAULT_SENSOR_DETECT,
    MOTOR_FAULT_SENSORLESS_OBSERVER
};

