rofiqcp/vesc_stm32f103rct6/src/hwconf/hw_status.c
// Parameter argument: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma
// pada lingkup ini.
// Fungsi status_thread: menjalankan operasi status thread sesuai tanggung jawab modul dengan input tervalidasi
// dan state yang konsisten.
void status_thread(void *argument);

// Fungsi highest_priority_fault: menangani highest priority fault dengan memprioritaskan pemadaman keluaran
// daya, pencatatan penyebab, dan pemulihan yang aman.
static motor_fault_t highest_priority_fault(void) {
    // Variabel left: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    const motor_fault_t left = g_motor_left.fault;
    // Variabel right: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    const motor_fault_t right = g_motor_right.fault;

    // Variabel i: indeks iterasi lokal untuk menelusuri elemen atau sampel secara deterministik.
    for (uint32_t i = 0U;
            i < (uint32_t)(sizeof(s_fault_priority) / sizeof(s_fault_priority[0]));
            i++) {
        if (left == s_fault_priority[i] || right == s_fault_priority[i]) {
            return s_fault_priority[i];
        }
    }
    return MOTOR_FAULT_NONE;
}

// Parameter digit: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma pada
// lingkup ini.
// Fungsi fault_digit_pulses: menangani fault digit pulses dengan memprioritaskan pemadaman keluaran daya,
// pencatatan penyebab, dan pemulihan yang aman.
static uint8_t fault_digit_pulses(uint8_t digit) {
    return digit == 0U ? 10U : digit;
}

// Fungsi hw_status_early_init: menginisialisasi hw status early init sehingga resource, konfigurasi awal, dan
// state modul siap digunakan dengan aman.
void hw_status_early_init(void) {
    /* This executes immediately after HAL_Init, while the MCU is still on the
     * reset HSI clock. It therefore proves execution even if the later 64 MHz
     * PLL or motor subsystem fails. */
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    // Variabel g: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    GPIO_InitTypeDef g = {
        0
    }
    ;
    g.Mode = GPIO_MODE_OUTPUT_PP;
    g.Speed = GPIO_SPEED_FREQ_LOW;

    g.Pin = LED_PIN;
    HAL_GPIO_Init(LED_PORT, &g);

    g.Pin = BUZZER_PIN | OFF_PIN;
    HAL_GPIO_Init(GPIOA, &g);

    /* Proven hoverboard board behavior: PA5 HIGH holds the controller powered.
     * It is a power-latch/OFF control, not the TIM1/TIM8 MOE gate-enable. */
    HAL_GPIO_WritePin(OFF_PORT, OFF_PIN, GPIO_PIN_SET);
    s_power_held = true;
    HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_SET);
}

// Fungsi hw_status_timer_init: menginisialisasi hw status timer init sehingga resource, konfigurasi awal, dan
// state modul siap digunakan dengan aman.
void hw_status_timer_init(void) {
    __HAL_RCC_TIM3_CLK_ENABLE();
    TIM3->CR1 = 0U;
    TIM3->DIER = 0U;
    TIM3->SR = 0U;
    /* At the required 64 MHz hoverboard clock, APB1=/2 but timer clock is
     * doubled back to 64 MHz. PSC=63 produces a 1 MHz timer counter. */
    TIM3->PSC = 63U;
    TIM3->ARR = 499U;
    TIM3->CNT = 0U;
    TIM3->EGR = TIM_EGR_UG;
    HAL_NVIC_SetPriority(TIM3_IRQn, 8U, 0U);
    HAL_NVIC_EnableIRQ(TIM3_IRQn);
}

// Parameter hz: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma pada
// lingkup ini.
// Fungsi hw_status_tone_start: memulai hw status tone start setelah prasyarat hardware, konfigurasi, dan state
// keselamatan terpenuhi.
void hw_status_tone_start(uint16_t hz) {
    /* Infinite tone: only an explicit hw_status_tone_stop ends it. Retained for
     * VESC API parity; the fault/startup sequences below prefer the bounded
     * hw_status_tone_start_for() so the buzzer can never be left stuck ON. */
    hw_status_tone_start_for(hz, 0U);
}

// Parameter hz: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma pada
// lingkup ini.
// Parameter duration_ms: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks
// algoritma pada lingkup ini.
// Fungsi hw_status_tone_start_for: memulai hw status tone start for setelah prasyarat hardware, konfigurasi,
// dan state keselamatan terpenuhi.
void hw_status_tone_start_for(uint16_t hz, uint32_t duration_ms) {
    if (hz < 100U)
        hz = 100U;
    if (hz > 5000U)
        hz = 5000U;

    // Variabel primask: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    /* A user/fault tone pre-empts the startup melody deterministically. */
    s_melody_sequencer = false;
    g_vesc_startup_melody_active = 0U;
    s_melody_gap = false;

    if (duration_ms == 0U) {
        TIM3->CR1 &= ~TIM_CR1_CEN;
        TIM3->DIER = 0U;
        // Variabel arr: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
        uint32_t arr = 500000UL / (uint32_t)hz;
        if (arr == 0U)
            arr = 1U;
        TIM3->ARR = arr - 1U;
        TIM3->CNT = 0U;
        TIM3->EGR = TIM_EGR_UG;
        TIM3->SR = 0U;
        s_tone_infinite = true;
        s_tone_toggle_remaining = 0U;
        s_tone_level = false;
        s_tone_running = true;
        g_vesc_buzzer_running = 1U;
        g_vesc_buzzer_hz = hz;
        g_vesc_buzzer_remaining = 0U;
        BUZZER_PORT->BRR = BUZZER_PIN;
        TIM3->DIER = TIM_DIER_UIE;
        TIM3->CR1 |= TIM_CR1_CEN;
    }
    else {
        status_program_segment_locked(hz, duration_ms, false);
    }
    if (!primask)
        __enable_irq();
}

// Parameter on: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma pada
// lingkup ini.
// Fungsi hw_status_power_hold: menjalankan operasi hw status power hold sesuai tanggung jawab modul dengan
// input tervalidasi dan state yang konsisten.
void hw_status_power_hold(bool on) {
    s_power_held = on;
    HAL_GPIO_WritePin(OFF_PORT, OFF_PIN, on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

// Fungsi hw_status_power_is_held: menjalankan operasi hw status power is held sesuai tanggung jawab modul
// dengan input tervalidasi dan state yang konsisten.
bool hw_status_power_is_held(void) {
    return s_power_held;
}

// Fungsi hw_status_tone_stop: menghentikan hw status tone stop dengan menonaktifkan output atau state terkait
// secara aman.
void hw_status_tone_stop(void) {
    // Variabel primask: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    s_melody_sequencer = false;
    g_vesc_startup_melody_active = 0U;
    status_timer_stop_locked();
    if (!primask)
        __enable_irq();
}

// Fungsi hw_status_tone_is_running: menjalankan operasi hw status tone is running sesuai tanggung jawab modul
// dengan input tervalidasi dan state yang konsisten.
bool hw_status_tone_is_running(void) {
    return s_tone_running;
}

