rofiqcp/vesc_stm32f103rct6/src/hwconf/hw_status.c
// Fungsi hw_status_tone_level: menjalankan operasi hw status tone level sesuai tanggung jawab modul dengan
// input tervalidasi dan state yang konsisten.
bool hw_status_tone_level(void) {
    return s_tone_level;
}

// Fungsi hw_status_tim3_irq_handler: menangani hw status tim3 irq handler pada konteks interrupt dengan
// pekerjaan minimum agar timing FOC tetap deterministik.
void hw_status_tim3_irq_handler(void) {
    if ((TIM3->SR & TIM_SR_UIF) == 0U)
        return;
    TIM3->SR &= ~TIM_SR_UIF;
    if (!s_tone_running)
        return;

    if (s_tone_infinite) {
        s_tone_level = !s_tone_level;
        if (s_tone_level)
            BUZZER_PORT->BSRR = BUZZER_PIN;
        else BUZZER_PORT->BRR = BUZZER_PIN;
        return;
    }

    if (s_tone_toggle_remaining > 0U)
        s_tone_toggle_remaining--;
    g_vesc_buzzer_remaining = s_tone_toggle_remaining;
    if (!s_melody_gap) {
        s_tone_level = !s_tone_level;
        if (s_tone_level)
            BUZZER_PORT->BSRR = BUZZER_PIN;
        else BUZZER_PORT->BRR = BUZZER_PIN;
    }
    else {
        s_tone_level = false;
        BUZZER_PORT->BRR = BUZZER_PIN;
    }

    if (s_tone_toggle_remaining == 0U) {
        if (s_melody_sequencer) {
            status_melody_load_next_locked();
        }
        else {
            status_timer_stop_locked();
        }
    }
}

// Parameter now: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma pada
// lingkup ini.
// Fungsi hw_status_service_10ms: menjalankan operasi hw status service 10ms sesuai tanggung jawab modul dengan
// input tervalidasi dan state yang konsisten.
void hw_status_service_10ms(uint32_t now) {
    /* Status/LED/buzzer is intentionally NOT a sixth task. Its non-blocking
     * state machine is serviced by VESC timer_thread every 10 ms. */
    // Variabel initialized: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    static bool initialized = false;
    // Variabel fault_deadline: status atau data gangguan untuk sistem proteksi.
    static uint32_t fault_deadline;
    // Variabel led_state: state mesin keadaan yang menentukan tahap operasi.
    static uint8_t led_state; /* 0=burst / 1=gap */
    // Variabel led_pulses_left: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    static uint8_t led_pulses_left;
    // Variabel led_output_on: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    static bool led_output_on;
    // Variabel led_deadline: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    static uint32_t led_deadline;
    // Variabel hb_led_on: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    static bool hb_led_on;
    // Variabel hb_deadline: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    static uint32_t hb_deadline;
    // Variabel led_mode: mode operasi yang menentukan jalur algoritma aktif.
    static uint8_t led_mode; /* 0=heartbeat, 1=cal, 2=detect, 3=run */
    // Variabel announced: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    static motor_fault_t announced;
    // Variabel fault_tens: status atau data gangguan untuk sistem proteksi.
    static uint8_t fault_tens;
    // Variabel fault_ones: status atau data gangguan untuk sistem proteksi.
    static uint8_t fault_ones;
    // Variabel fault_group: status atau data gangguan untuk sistem proteksi.
    static uint8_t fault_group;
    // Variabel fault_pulses_left: status atau data gangguan untuk sistem proteksi.
    static uint8_t fault_pulses_left;
    // Variabel fault_stage: status atau data gangguan untuk sistem proteksi.
    static uint8_t fault_stage;
    // Variabel fault_output_on: status atau data gangguan untuk sistem proteksi.
    static bool fault_output_on;

    if (!initialized) {
        fault_deadline = now;
        led_state = 0U;
        led_pulses_left = 0U;
        led_output_on = false;
        led_deadline = now;
        hb_led_on = false;
        hb_deadline = now + 500U;
        led_mode = 0xFFU; /* force first-mode initialization */
        motor_hw_led(false);
        announced = MOTOR_FAULT_NONE;
        fault_tens = fault_ones = fault_group = 0U;
        fault_pulses_left = fault_stage = 0U;
        fault_output_on = false;
        initialized = true;
    }

    // Variabel fault: status atau data gangguan untuk sistem proteksi.
    const motor_fault_t fault = highest_priority_fault();

    if (fault != MOTOR_FAULT_NONE && g_vesc_startup_melody_active) {
        hw_status_tone_stop();
    }

    if (fault != MOTOR_FAULT_NONE) {
        if (fault != announced) {
            announced = fault;
            // Variabel code: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
            const uint8_t code = (uint8_t)motor_fault_to_vesc(fault);
            fault_tens = (uint8_t)(code / 10U);
            fault_ones = (uint8_t)(code % 10U);
            fault_group = fault_tens != 0U ? 0U : 1U;
            // Variabel digit: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
            const uint8_t digit = fault_group == 0U ? fault_tens : fault_ones;
            fault_pulses_left = fault_digit_pulses(digit);
            fault_stage = 1U;
            fault_output_on = true;
            motor_hw_led(true);
            hw_status_tone_start_for(fault_group == 0U ? 1500U : 2400U, 100U);
            fault_deadline = now + 100U;
        }
        else if ((int32_t)(now - fault_deadline) >= 0) {
            if (fault_stage == 1U) {
                if (fault_output_on) {
                    motor_hw_led(false);
                    hw_status_tone_stop();
                    fault_output_on = false;
                    if (fault_pulses_left > 0U) {
                        fault_pulses_left--;
                    }
                    if (fault_pulses_left == 0U) {
                        if (fault_group == 0U) {
                            fault_stage = 2U;
                            fault_deadline = now + 350U;
                        }
                        else {
                            fault_stage = 3U;
                            fault_deadline = now + 1000U;
                        }
                    }
                    else {
                        fault_deadline = now + 100U;
                    }
                }
                else {
                    fault_output_on = true;
                    motor_hw_led(true);
                    hw_status_tone_start(fault_group == 0U ? 1500U : 2400U);
                    fault_deadline = now + 100U;
                }
            }
            else if (fault_stage == 2U) {
                fault_group = 1U;
                fault_pulses_left = fault_digit_pulses(fault_ones);
                fault_stage = 1U;
                fault_output_on = true;
                motor_hw_led(true);
                hw_status_tone_start_for(2400U, 100U);
                fault_deadline = now + 100U;
            }
            else {
                fault_group = fault_tens != 0U ? 0U : 1U;
                // Variabel digit: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
                const uint8_t digit = fault_group == 0U ? fault_tens : fault_ones;
                fault_pulses_left = fault_digit_pulses(digit);
                fault_stage = 1U;
                fault_output_on = true;
                motor_hw_led(true);
                hw_status_tone_start(fault_group == 0U ? 1500U : 2400U);
                fault_deadline = now + 100U;
            }
        }
    }
    else {
        if (announced != MOTOR_FAULT_NONE || fault_output_on) {
            hw_status_tone_stop();
            fault_output_on = false;
            /* Reset mesin mode-cue (burst/gap) biar LED gak nyangkut di
             * tengah pulsa saat keluar dari fault. */
            led_state = 0U;
            led_pulses_left = 0U;
            led_output_on = false;
            hb_led_on = false;
            hb_deadline = now + 500U;
            led_mode = 0xFFU;
            motor_hw_led(false);
        }
        announced = MOTOR_FAULT_NONE;
        fault_stage = 0U;

        /* LED status follows the proven SmartESC idea: a healthy controller
         * must always have an obvious periodic heartbeat. Additional burst modes
         * are retained for calibration/detection/running, but every transition
         * is explicitly re-initialized so the LED cannot inherit a stale pulse
         * counter/deadline from the previous mode.
         *
         *   calibrating -> 1 pulse burst (200 ms on/off), 1 s gap
         *   detecting   -> 2 pulse burst, 1 s gap
         *   running     -> 3 pulse burst, 1 s gap
         *   idle/ready  -> 500 ms toggle heartbeat (SmartESC-like normal blink)
         */
        // Variabel calibrating: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
        const bool calibrating = !foc_calibration_done();
        // Variabel detecting: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
        const bool detecting = g_motor_left.detect.busy ||
                g_motor_right.detect.busy;
        // Variabel running: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
        const bool running = g_motor_left.pwm_enabled ||
                g_motor_right.pwm_enabled;
        // Variabel mode: mode operasi yang menentukan jalur algoritma aktif.
        const uint8_t mode = calibrating ? 1U :
                             (detecting ? 2U :
                             (running ? 3U : 0U));
        // Variabel pulses: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
        const uint8_t pulses = mode;

        if (mode != led_mode) {
            led_mode = mode;
            led_state = 0U;
            led_pulses_left = 0U;
            led_output_on = false;
            led_deadline = now;
            hb_led_on = false;
            hb_deadline = now + 500U;
            motor_hw_led(false);
        }

        if (pulses != 0U) {
            if (led_state == 0U) {
                if (led_pulses_left == 0U) {
                    led_pulses_left = pulses;
                    led_output_on = true;
                    motor_hw_led(true);
                    led_deadline = now + 200U;
                }
                else if ((int32_t)(now - led_deadline) >= 0) {
                    led_output_on = !led_output_on;
                    motor_hw_led(led_output_on);
                    if (!led_output_on) {
                        led_pulses_left--;
                        if (led_pulses_left == 0U) {
                            led_state = 1U;
                            led_deadline = now + 1000U;
                        }
                        else {
                            led_deadline = now + 200U;
                        }
                    }
                    else {
                        led_deadline = now + 200U;
                    }
                }
            }
            else {
                motor_hw_led(false);
                if ((int32_t)(now - led_deadline) >= 0) {
                    led_state = 0U;
                    led_pulses_left = 0U;
                    led_output_on = false;
                }
            }
        }
        else if ((int32_t)(now - hb_deadline) >= 0) {
            /* SmartESC normal path toggles its LED roughly every 0.5 s. Use an
             * absolute deadline rather than an 8-bit divider so delayed timer
             * service cannot permanently distort the blink cadence. */
            hb_led_on = !hb_led_on;
            motor_hw_led(hb_led_on);
            hb_deadline = now + 500U;
        }

