rofiqcp/vesc_stm32f103rct6/src/hwconf/hw_status.c
    }

}

// Fungsi hw_status_init: menginisialisasi hw status init sehingga resource, konfigurasi awal, dan state modul
// siap digunakan dengan aman.
bool hw_status_init(void) {
    s_status_started = true;
    /* Start the complete 3.21 s power-on melody before FreeRTOS. TIM3 advances
     * notes/gaps autonomously, so UART/FOC startup proceeds concurrently and the
     * melody cannot disappear merely because timer_thread has not run yet. */
    hw_status_startup_melody_begin();
    return true;
}

// Parameter delay_ms: nilai kerja yang menyimpan state, parameter, atau hasil antara sesuai konteks algoritma
// pada lingkup ini.
// Fungsi early_fatal_delay_with_comm: menjalankan operasi early fatal delay with comm sesuai tanggung jawab
// modul dengan input tervalidasi dan state yang konsisten.
static void early_fatal_delay_with_comm(uint32_t delay_ms) {
    // Variabel start: nilai kerja yang menyimpan state atau hasil antara sesuai konteks algoritma pada lingkup ini.
    const uint32_t start = HAL_GetTick();
    while ((HAL_GetTick() - start) < delay_ms) {
        /* If USART3/commands were already brought up, preserve VESC Tool
         * recovery access even though the motor subsystem is in early-fatal. */
        if (commands_is_initialized()) {
            (void)vesc_comm_poll_once();
        }
        HAL_Delay(1U);
    }
}

// Fungsi hw_status_early_fatal_loop: menjalankan operasi hw status early fatal loop sesuai tanggung jawab modul
// dengan input tervalidasi dan state yang konsisten.
void hw_status_early_fatal_loop(void) {
    hw_status_tone_stop();
    HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_RESET);
    for (;; ) {
        /* Pre-scheduler failure memakai LED saja. Buzzer otomatis dicadangkan
         * untuk power-on melody dan fault-code runtime agar tidak ada pola audio
         * yang ambigu. UART tetap serviceable jika sudah diinisialisasi. */
        // Variabel i: indeks iterasi lokal untuk menelusuri elemen atau sampel secara deterministik.
        for (uint8_t i = 0U; i < 4U; i++) {
            motor_hw_led(true);
            early_fatal_delay_with_comm(80U);
            motor_hw_led(false);
            early_fatal_delay_with_comm(80U);
        }
        early_fatal_delay_with_comm(800U);
    }
}
